#### Terraform Plan 📖
```hcl
tls_private_key.bastion: Refreshing state... [id=3c1eb9f3e41da3bfe09ba7ae87d51aad27f7f449]
random_password.ec2_admin_password: Refreshing state... [id=none]
random_password.rds_password: Refreshing state... [id=none]
aws_key_pair.bastion: Refreshing state... [id=olistflow-etl-dev-bastion-key]
aws_vpc.main: Refreshing state... [id=vpc-0da07437da69f16f1]
aws_secretsmanager_secret.bastion_keypair: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:916740064153:secret:olistflow-etl-dev-bastion-keypair-9NwWbX]
data.aws_iam_policy_document.glue_assume: Reading...
aws_eip.nat: Refreshing state... [id=eipalloc-03c9cb5f6785cf3fc]
aws_iam_role.bastion_role: Refreshing state... [id=olistflow-etl-dev-bastion-role]
data.aws_caller_identity.current: Reading...
aws_glue_catalog_database.curated: Refreshing state... [id=916740064153:olistflow_etl_curated]
data.aws_iam_policy_document.glue_assume: Read complete after 0s [id=2681768870]
aws_s3_bucket.raw: Refreshing state... [id=olistflow-etl-dev-raw]
aws_s3_bucket.curated: Refreshing state... [id=olistflow-etl-dev-curated]
data.aws_ami.windows: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=916740064153]
aws_secretsmanager_secret.rds_password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:916740064153:secret:olistflow-etl-dev-rds-master-password-sHNmOS]
aws_glue_catalog_database.raw: Refreshing state... [id=916740064153:olistflow_etl_raw]
aws_secretsmanager_secret.ec2_password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:916740064153:secret:olistflow-etl-dev-ec2-master-password-sJ6z1W]
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.sfn_assume: Reading...
data.aws_iam_policy_document.sfn_assume: Read complete after 0s [id=4022981484]
aws_s3_bucket.artifacts: Refreshing state... [id=olistflow-etl-dev-artifacts]
aws_glue_classifier.csv_olist: Refreshing state... [id=olistflow_etl_dev_csv_classifier]
data.aws_availability_zones.available: Reading...
aws_iam_role.glue_role: Refreshing state... [id=olistflow-etl-dev-glue-role]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_secretsmanager_secret_version.bastion_keypair: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:916740064153:secret:olistflow-etl-dev-bastion-keypair-9NwWbX|terraform-20260120153941553300000005]
aws_secretsmanager_secret_version.rds_password_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:916740064153:secret:olistflow-etl-dev-rds-master-password-sHNmOS|terraform-20260120153941596600000006]
aws_iam_role.sfn_role: Refreshing state... [id=olistflow-etl-dev-sfn-role]
aws_secretsmanager_secret_version.ec2_password_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:916740064153:secret:olistflow-etl-dev-ec2-master-password-sJ6z1W|terraform-20260120153941541200000004]
aws_iam_role_policy_attachment.bastion_s3_readonly: Refreshing state... [id=olistflow-etl-dev-bastion-role/arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess]
aws_iam_instance_profile.bastion_profile: Refreshing state... [id=olistflow-etl-dev-bastion-instance-profile]
data.aws_ami.windows: Read complete after 1s [id=ami-06f5f29d1fe41ea03]
data.aws_secretsmanager_secret_version.rds_password: Reading...
data.aws_secretsmanager_secret_version.ec2_password: Reading...
data.aws_secretsmanager_secret_version.rds_password: Read complete after 0s [id=olistflow-etl-dev-rds-master-password|AWSCURRENT]
data.aws_secretsmanager_secret_version.ec2_password: Read complete after 0s [id=olistflow-etl-dev-ec2-master-password|AWSCURRENT]
aws_s3_bucket_versioning.curated: Refreshing state... [id=olistflow-etl-dev-curated]
aws_s3_bucket_server_side_encryption_configuration.curated: Refreshing state... [id=olistflow-etl-dev-curated]
aws_s3_bucket_server_side_encryption_configuration.raw: Refreshing state... [id=olistflow-etl-dev-raw]
aws_s3_bucket_versioning.raw: Refreshing state... [id=olistflow-etl-dev-raw]
aws_glue_crawler.raw: Refreshing state... [id=olistflow_etl_dev_raw_crawler]
aws_s3_object.add_raw_files["olist_order_reviews_dataset.csv"]: Refreshing state... [id=olistflow-etl-dev-raw/olist/olist_order_reviews_dataset.csv]
aws_s3_object.add_raw_files["olist_customers_dataset.csv"]: Refreshing state... [id=olistflow-etl-dev-raw/olist/olist_customers_dataset.csv]
aws_s3_object.add_raw_files["olist_orders_dataset.csv"]: Refreshing state... [id=olistflow-etl-dev-raw/olist/olist_orders_dataset.csv]
aws_s3_object.add_raw_files["olist_sellers_dataset.csv"]: Refreshing state... [id=olistflow-etl-dev-raw/olist/olist_sellers_dataset.csv]
aws_s3_object.add_raw_files["olist_products_dataset.csv"]: Refreshing state... [id=olistflow-etl-dev-raw/olist/olist_products_dataset.csv]
aws_s3_object.add_raw_files["olist_order_items_dataset.csv"]: Refreshing state... [id=olistflow-etl-dev-raw/olist/olist_order_items_dataset.csv]
aws_s3_object.add_raw_files["olist_order_payments_dataset.csv"]: Refreshing state... [id=olistflow-etl-dev-raw/olist/olist_order_payments_dataset.csv]
aws_s3_bucket_versioning.artifacts: Refreshing state... [id=olistflow-etl-dev-artifacts]
aws_s3_bucket_server_side_encryption_configuration.artifacts: Refreshing state... [id=olistflow-etl-dev-artifacts]
aws_s3_object.add_sql_script["init.sql"]: Refreshing state... [id=olistflow-etl-dev-artifacts/scripts/sql/init.sql]
aws_s3_object.add_glue_jobs_files["curated_to_rds.py"]: Refreshing state... [id=olistflow-etl-dev-artifacts/glue/jobs/curated_to_rds.py]
aws_s3_object.add_glue_jobs_files["raw_to_curated.py"]: Refreshing state... [id=olistflow-etl-dev-artifacts/glue/jobs/raw_to_curated.py]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-089bb4e40dcbe64d7]
aws_security_group.bastion: Refreshing state... [id=sg-0a1c8ab332b0e3218]
aws_subnet.public[0]: Refreshing state... [id=subnet-0af299c72738d86c0]
aws_subnet.public[1]: Refreshing state... [id=subnet-08926834b73ff9fa7]
aws_subnet.private[0]: Refreshing state... [id=subnet-02b1bad805a11690a]
aws_subnet.private[1]: Refreshing state... [id=subnet-0b5a89eac983b32c8]
aws_internet_gateway.main: Refreshing state... [id=igw-0fc5e6f7622c34d56]
aws_security_group.rds: Refreshing state... [id=sg-04c4632822dad6313]
aws_nat_gateway.main: Refreshing state... [id=nat-05caf26776d2d66a0]
aws_instance.bastion: Refreshing state... [id=i-04198eba6fe0cdd42]
aws_route_table.public: Refreshing state... [id=rtb-08f436822ca982bdd]
aws_db_subnet_group.main: Refreshing state... [id=olistflow-etl-dev]
aws_route_table.private: Refreshing state... [id=rtb-03e4306ff6827f66c]
aws_security_group_rule.rds_access: Refreshing state... [id=sgrule-4232071823]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ebd6c86984918ec2]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d0e9489aa6349928]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0115427dd76f940e2]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-04fc411cfd3e81530]
aws_db_instance.main: Refreshing state... [id=db-65KEEZ73ZA3SK255SN4XQC4Y5Y]
aws_glue_connection.rds: Refreshing state... [id=916740064153:olistflow_etl_dev_rds_jdbc]
local_file.pgadmin_servers: Refreshing state... [id=8f202e75baf8036f2b8826c186f4e1100703d294]
aws_s3_object.add_pgadmin_servers_connection_details: Refreshing state... [id=olistflow-etl-dev-artifacts/pgadmin/servers.json]
aws_glue_job.raw_to_curated: Refreshing state... [id=olistflow_etl_dev_raw_to_curated]
aws_glue_job.curated_to_rds: Refreshing state... [id=olistflow_etl_dev_curated_to_rds]
data.aws_iam_policy_document.glue_policy: Reading...
data.aws_iam_policy_document.glue_policy: Read complete after 0s [id=2320705437]
aws_iam_role_policy.glue_inline: Refreshing state... [id=olistflow-etl-dev-glue-role:olistflow-etl-dev-glue-inline]
data.aws_iam_policy_document.sfn_policy: Reading...
aws_sfn_state_machine.etl: Refreshing state... [id=arn:aws:states:us-east-1:916740064153:stateMachine:olistflow-etl-dev-orchestrator]
data.aws_iam_policy_document.sfn_policy: Read complete after 0s [id=1272447287]
aws_iam_role_policy.sfn_inline: Refreshing state... [id=olistflow-etl-dev-sfn-role:olistflow-etl-dev-sfn-inline]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.bastion has changed
  ~ resource "aws_instance" "bastion" {
        id                                   = "i-04198eba6fe0cdd42"
      ~ public_ip                            = "54.197.34.113" -> "54.159.202.7"
        tags                                 = {
            "Name" = "windows-bastion-rds"
        }
        # (33 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.bastion will be updated in-place
  ~ resource "aws_instance" "bastion" {
        id                                   = "i-04198eba6fe0cdd42"
      ~ public_dns                           = "ec2-54-159-202-7.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.159.202.7" -> (known after apply)
        tags                                 = {
            "Name" = "windows-bastion-rds"
        }
        # (32 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # aws_lakeformation_permissions.remove_curated_db_permissions will be created
  + resource "aws_lakeformation_permissions" "remove_curated_db_permissions" {
      + catalog_resource              = false
      + id                            = (known after apply)
      + permissions                   = [
          + "ALTER",
          + "DESCRIBE",
        ]
      + permissions_with_grant_option = (known after apply)
      + principal                     = "arn:aws:iam::916740064153:role/olistflow-etl-dev-glue-role"
      + region                        = "us-east-1"

      + database {
          + catalog_id = (known after apply)
          + name       = "olistflow_etl_curated"
        }
    }

  # aws_lakeformation_permissions.remove_raw_db_permissions will be created
  + resource "aws_lakeformation_permissions" "remove_raw_db_permissions" {
      + catalog_resource              = false
      + id                            = (known after apply)
      + permissions                   = [
          + "ALTER",
          + "DESCRIBE",
        ]
      + permissions_with_grant_option = (known after apply)
      + principal                     = "arn:aws:iam::916740064153:role/olistflow-etl-dev-glue-role"
      + region                        = "us-east-1"

      + database {
          + catalog_id = (known after apply)
          + name       = "olistflow_etl_raw"
        }
    }

  # aws_security_group.bastion will be updated in-place
  ~ resource "aws_security_group" "bastion" {
        id                     = "sg-0a1c8ab332b0e3218"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "99.241.135.123/32",
                ]
              - description      = ""
              - from_port        = 3389
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "99.241.135.123/32",
                  + "129.41.87.2/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
        ]
        name                   = "bastion-windows-20260120153957810600000007"
        tags                   = {}
        # (9 unchanged attributes hidden)
    }

  # aws_security_group_rule.rds_access will be created
  + resource "aws_security_group_rule" "rds_access" {
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = "sg-04c4632822dad6313"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0a1c8ab332b0e3218"
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # local_file.pgadmin_servers will be created
  + resource "local_file" "pgadmin_servers" {
      + content              = jsonencode(
            {
              + Servers = {
                  + "1" = {
                      + Group         = "Servers"
                      + Host          = "olistflow-etl-dev.ct6v1kobwsnl.us-east-1.rds.amazonaws.com"
                      + MaintenanceDB = "postgres"
                      + Name          = "RDS Postgres"
                      + Port          = 5432
                      + SSLMode       = "require"
                      + Username      = "postgres"
                    }
                }
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./artifacts/servers.json"
      + id                   = (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ bastion_public_ip = "54.197.34.113" -> (known after apply)

Warning: Value is base64 encoded

  with aws_instance.bastion,
  on bastion.tf line 60, in resource "aws_instance" "bastion":
  60:   user_data = base64encode(templatefile("../scripts/windows/windows-userdata.ps1", {
  61:     admin_password = data.aws_secretsmanager_secret_version.ec2_password.secret_string
  62:   }))

The value is base64 encoded. If you want to use base64 encoding, please use
the user_data_base64 argument. user_data attribute is set as cleartext in
state

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```